glcloud/keil_v5/ARM/PACK/.Web/NXP.LPC51U68_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>LPC51U68_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for LPC51U68</description>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="11.0.1">Removed invalid entries from Software Content Register</release>
    <release version="11.0.0">NXP CMSIS packs based on MCUXpresso SDK 2.5.0</release>
    <release version="10.0.1">A problem with missing debug config options, which caused invalid ROM table error when using MDK IDE CMSIS-DAP debugging tool was fixed (KEX-4724).</release>
    <release version="10.0.0">First version of the LPC51U68 device family pack</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
    <description Cclass="CMSIS Driver">NXP MCUXpresso SDK Peripheral CMSIS Drivers</description>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Start up</description>
  </taxonomy>
  <devices>
    <family Dfamily="LPC51U68" Dvendor="NXP:11">
      <description>The LPC51U68 are ARM Cortex-M0+ based microcontrollers for embedded applications.These devices include 96 KB of on-chip SRAM, 256 KB on-chip flash, full-speed USB device interface, and I2S, three general-purpose timers, one versatile timer with PWM and many other capabilities (SCTimer/PWM), one RTC/alarm timer, one 24-bit Multi-Rate Timer (MRT), a Windowed Watchdog Timer (WWDT), eight flexible serial communication peripherals (each of which can be a USART, SPIs, or I2C interface), and one 12-bit 5.0 Msps ADC, and a temperature sensor. The ARM Cortex-M0+ coprocessor available on some devices is an energy-efficient and easy-to-use 32-bit core which is code- and tool-compatible with the core. The Cortex-M0+ coprocessor offers up to 100 MHz performance with a simple instruction set and reduced code size.</description>
      <device Dname="LPC51U68">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dendian="Little-endian" Dclock="100000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/LPC51U68_flash.icf"/>
        </environment>
        <environment name="uv">
          <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x0)</postBuild1>
          <postRun1>1</postRun1>
        </environment>
        <sequences>
          <sequence name="ForceCoreHalt">
            <block>
      __var SCS_Addr   = 0xE000E000;
      __var AIRCR_Addr = SCS_Addr + 0xD0C;
      __var DHCSR_Addr = SCS_Addr + 0xDF0;
      __var DCRSR_Addr = SCS_Addr + 0xDF4;
      __var DCRDR_Addr = SCS_Addr + 0xDF8;
      __var DHCSR_Val  = 0;
    </block>
            <control while="((DHCSR_Val = Read32(DHCSR_Addr)) &amp; 0x00020000) == 0" timeout="100000"/>
            <control if="(DHCSR_Val &amp; 0x00020000) == 0">
              <block info="Halt core">
        Write32(DHCSR_Addr,0xA05F0003);                                  // halt core
      </block>
              <control while="(Read32(DHCSR_Addr) &amp; 0x00020000) == 0" timeout="1000"/>
            </control>
          </sequence>
          <sequence name="ResetSystem" info="SYSRESETREQ">
            <block>
      __var SCS_Addr   = 0xE000E000;
      __var AIRCR_Addr = SCS_Addr + 0xD0C;
      __var DHCSR_Addr = SCS_Addr + 0xDF0;

      __errorcontrol = 1;                                              // ignore errors
      Write32(AIRCR_Addr, 0x05FA0004);                                 // Execute SYSRESETREQ via AIRCR
      __errorcontrol = 0;                                              // check errors

      DAP_Delay(1000);                                                 // time for reset
    </block>
            <control while="(Read32(DHCSR_Addr) &amp; 0x02000000) == 0" timeout="100000"/>
            <block>
      Sequence("ForceCoreHalt");                                       // halt the core
    </block>
          </sequence>
          <sequence name="ResetProcessor" info="VECTRESET" disable="true">
  </sequence>
          <sequence name="ResetHardware" info="HW RESET">
            <block>
      __var nReset      = 0x80;
      __var canReadPins = 0;

      canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);     // Deassert nRESET line
    </block>
            <control while="1" timeout="50000"/>
            <control if="canReadPins">
              <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
            </control>
            <control if="!canReadPins">
              <block>
        DAP_SWJ_Pins(nReset, nReset, 0);                               // Assert nRESET line
      </block>
              <control while="1" timeout="100000"/>
            </control>
            <block>
      Sequence("ForceCoreHalt");                                       // halt the core
    </block>
          </sequence>
          <sequence name="ResetCatchSet">
            <block>
      __var SCS_Addr   = 0xE000E000;
      __var DHCSR_Addr = SCS_Addr + 0xDF0;
      __var DEMCR_Addr = SCS_Addr + 0xDFC;
      __var value      = 0;
      __var FPB_BKPT_H = 0x80000000;
      __var FPB_BKPT_L = 0x40000000;
      __var FPB_COMP_M = 0x1FFFFFFC;
      __var FPB_KEY    = 0x00000002;
      __var FPB_ENABLE = 0x00000001;
    </block>
            <block>
      value = Read32(DEMCR_Addr);
      Write32(DEMCR_Addr, (value &amp; (~0x00000001)));                // Disable Reset Vector Catch in DEMCR
    </block>
            <block>
      Write32(0x40000000, 0x00000002);                                 // Map Flash to Vectors
      value = Read32 (0x00000004);                                     // Read Reset Vector

      value = ((value &amp; 0x02) ? FPB_BKPT_H : FPB_BKPT_L) | (value &amp; FPB_COMP_M) | FPB_ENABLE ;
      Write32(0xE0002008, value);                                      // Set BP0 to Reset Vector
      Write32(0xE0002000, (FPB_KEY | FPB_ENABLE));                     // Enable FPB
    </block>
            <block>
      Read32(DHCSR_Addr);                                              // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
    </block>
          </sequence>
          <sequence name="ResetCatchClear">
            <block>
      __var SCS_Addr   = 0xE000E000;
      __var DEMCR_Addr = SCS_Addr + 0xDFC;
      __var value      = 0;

